- **Terraform formatting and style 🖌 ``**
- **Terraform initialization ⚙️ `success`**
- **Terraform plan 📖 `success`**
- **Terraform validation 🤖 `success`**
<details><summary>Show plan output</summary>
```

module.processing_queue["prod"].data.archive_file.processing_lambda_source: Reading...
module.processing_queue["dev"].data.archive_file.processing_lambda_source: Reading...
module.frontend_bucket["prod"].aws_cloudfront_origin_access_identity.frontend_oai: Refreshing state... [id=E25UK2ZATDNFS6]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.photo_bucket["prod"].aws_cloudfront_origin_access_identity.photo_oai: Refreshing state... [id=EOH3ANZHA17JI]
aws_s3_bucket.mysql_backup_bucket: Refreshing state... [id=kickin-media-db-backup]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.photo_bucket["prod"].aws_s3_bucket.photo_s3_bucket: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["dev"].aws_cloudfront_origin_access_identity.photo_oai: Refreshing state... [id=E9UIM00KKJQDD]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.processing_queue["dev"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.frontend_bucket["dev"].aws_cloudfront_origin_access_identity.frontend_oai: Refreshing state... [id=E38IC32PF933UN]
module.frontend_bucket["dev"].data.aws_iam_openid_connect_provider.example: Reading...
module.photo_bucket["dev"].aws_s3_bucket.photo_s3_bucket: Refreshing state... [id=kickin-media-photo-dev]
module.frontend_bucket["dev"].data.aws_iam_openid_connect_provider.example: Read complete after 0s [id=arn:aws:iam::990658861879:oidc-provider/token.actions.githubusercontent.com]
module.frontend_bucket["prod"].aws_s3_bucket.frontend_s3_bucket: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["dev"].aws_s3_bucket.frontend_s3_bucket: Refreshing state... [id=kickin-media-frontend-dev]
module.frontend_bucket["prod"].data.aws_iam_openid_connect_provider.example: Reading...
module.processing_queue["dev"].aws_sqs_queue.photo-processing-queue-dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-dev-dlq]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue-dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-prod-dlq]
module.processing_queue["dev"].data.archive_file.processing_lambda_source: Read complete after 1s [id=849704cfe2198a44497c7730453d6e336486ba9a]
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Read complete after 1s [id=849704cfe2198a44497c7730453d6e336486ba9a]
module.processing_queue["prod"].aws_iam_role.lambda-execution-role: Refreshing state... [id=media-photo-processing-prod-execution-role]
module.processing_queue["dev"].aws_iam_role.lambda-execution-role: Refreshing state... [id=media-photo-processing-dev-execution-role]
module.frontend_bucket["prod"].data.aws_iam_openid_connect_provider.example: Read complete after 0s [id=arn:aws:iam::990658861879:oidc-provider/token.actions.githubusercontent.com]
module.processing_queue["prod"].aws_lambda_function.processing_lambda: Refreshing state... [id=photo-processing-lambda-prod]
module.processing_queue["dev"].aws_lambda_function.processing_lambda: Refreshing state... [id=photo-processing-lambda-dev]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-prod]
module.processing_queue["dev"].aws_sqs_queue.photo-processing-queue: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-dev]
module.processing_queue["dev"].aws_iam_policy.lambda-role-policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/media-photo-processing-dev-processing-policy]
module.processing_queue["prod"].aws_iam_policy.lambda-role-policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/media-photo-processing-prod-processing-policy]
module.processing_queue["dev"].aws_iam_role_policy_attachment.lambda-execution-role-policy: Refreshing state... [id=media-photo-processing-dev-execution-role-20221120084244157600000002]
module.processing_queue["prod"].aws_iam_role_policy_attachment.lambda-execution-role-policy: Refreshing state... [id=media-photo-processing-prod-execution-role-20221120084244149900000001]
module.processing_queue["prod"].aws_lambda_event_source_mapping.processing_lambda_event_mapping: Refreshing state... [id=c3cd01e2-f797-41cb-b3db-b9c9d7845375]
module.processing_queue["dev"].aws_lambda_event_source_mapping.processing_lambda_event_mapping: Refreshing state... [id=baa3f7b1-602f-47be-a922-182b0975efd6]
aws_s3_bucket_public_access_block.mysql_s3_bucket_public_acl: Refreshing state... [id=kickin-media-db-backup]
aws_iam_policy.mysql_backup_upload_user_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-db-backup-db-backup-policy]
aws_s3_bucket_acl.mysql_s3_bucket_acl: Refreshing state... [id=kickin-media-db-backup,private]
aws_iam_user.mysql_backup_upload_user: Refreshing state... [id=kickin-media-db-backup-db-backup-user]
aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle: Refreshing state... [id=kickin-media-db-backup]
module.photo_bucket["prod"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["prod"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["dev"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["dev"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-photo-dev-upload-policy]
module.photo_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-photo-prod-upload-policy]
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Reading...
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Read complete after 0s [id=3513791596]
module.photo_bucket["dev"].data.aws_iam_policy_document.photo_allow_cloudfront: Reading...
module.photo_bucket["dev"].data.aws_iam_policy_document.photo_allow_cloudfront: Read complete after 0s [id=1632310300]
module.photo_bucket["prod"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["dev"].aws_iam_user.upload_user: Refreshing state... [id=kickin-media-photo-dev-upload-user]
module.photo_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=kickin-media-photo-prod-upload-user]
aws_iam_user_policy_attachment.mysql_backup_user_attachment: Refreshing state... [id=kickin-media-db-backup-db-backup-user-20221120084011901900000001]
module.photo_bucket["dev"].aws_s3_bucket_policy.photo_s3_bucket_policy: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["prod"].aws_s3_bucket_policy.photo_s3_bucket_policy: Refreshing state... [id=kickin-media-photo-prod]
module.frontend_bucket["prod"].aws_iam_role.frontend_upload_role: Refreshing state... [id=kickin-media-frontend-prod-upload-role]
module.frontend_bucket["dev"].aws_iam_role.frontend_upload_role: Refreshing state... [id=kickin-media-frontend-dev-upload-role]
module.frontend_bucket["prod"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["dev"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl: Refreshing state... [id=kickin-media-frontend-dev]
module.frontend_bucket["prod"].aws_cloudfront_distribution.frontend_cloudfront_distribution: Refreshing state... [id=E1IUXQS0ADPZ3N]
module.frontend_bucket["dev"].aws_cloudfront_distribution.frontend_cloudfront_distribution: Refreshing state... [id=E3VQB16JMRSNQE]
module.frontend_bucket["prod"].aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["dev"].aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=kickin-media-frontend-dev]
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Reading...
module.frontend_bucket["dev"].data.aws_iam_policy_document.frontend_allow_cloudfront: Reading...
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Read complete after 0s [id=4179026155]
module.frontend_bucket["prod"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["dev"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration: Refreshing state... [id=kickin-media-frontend-dev]
module.frontend_bucket["dev"].data.aws_iam_policy_document.frontend_allow_cloudfront: Read complete after 0s [id=1929207177]
module.photo_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=kickin-media-photo-prod-upload-user-20221120083913170700000004]
module.photo_bucket["dev"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=kickin-media-photo-dev-upload-user-20221120083913161200000003]
module.frontend_bucket["prod"].aws_s3_bucket_policy.frontend_s3_bucket_policy: Refreshing state... [id=kickin-media-frontend-prod]
module.frontend_bucket["dev"].aws_s3_bucket_policy.frontend_s3_bucket_policy: Refreshing state... [id=kickin-media-frontend-dev]
module.frontend_bucket["prod"].aws_iam_policy.upload_role_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-frontend-prod-upload-policy]
module.frontend_bucket["dev"].aws_iam_policy.upload_role_policy: Refreshing state... [id=arn:aws:iam::990658861879:policy/kickin-media-frontend-dev-upload-policy]
module.frontend_bucket["dev"].aws_s3_bucket_acl.frontend_s3_bucket_acl: Refreshing state... [id=kickin-media-frontend-dev,private]
module.frontend_bucket["prod"].aws_s3_bucket_acl.frontend_s3_bucket_acl: Refreshing state... [id=kickin-media-frontend-prod,private]
module.frontend_bucket["prod"].aws_iam_role_policy_attachment.upload_role_attachment: Refreshing state... [id=kickin-media-frontend-prod-upload-role-20250425093921332700000002]
module.frontend_bucket["dev"].aws_iam_role_policy_attachment.upload_role_attachment: Refreshing state... [id=kickin-media-frontend-dev-upload-role-20250425093921291100000001]
module.photo_bucket["prod"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors: Refreshing state... [id=kickin-media-photo-prod]
module.photo_bucket["dev"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors: Refreshing state... [id=kickin-media-photo-dev]
module.photo_bucket["prod"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy: Refreshing state... [id=7d3cab49-f03d-4856-80ce-2e997f5b5f40]
module.photo_bucket["dev"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy: Refreshing state... [id=7d4a0748-46fc-4d77-a913-950c8c064fdb]
module.photo_bucket["dev"].aws_cloudfront_distribution.photo_cloudfront_distribution: Refreshing state... [id=EJRIX53CDQ2GO]
module.photo_bucket["prod"].aws_cloudfront_distribution.photo_cloudfront_distribution: Refreshing state... [id=E1OUOQKS00XMR3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.processing_queue["dev"].data.aws_iam_policy_document.lambda-role-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-role-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-west-1:990658861879:media-photo-processing-dev",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:HeadObject",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::kickin-media-photo-dev/*",
            ]
        }
    }

  # module.processing_queue["dev"].aws_iam_policy.lambda-role-policy will be updated in-place
  ~ resource "aws_iam_policy" "lambda-role-policy" {
        id               = "arn:aws:iam::990658861879:policy/media-photo-processing-dev-processing-policy"
        name             = "media-photo-processing-dev-processing-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueUrl",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-west-1:990658861879:media-photo-processing-dev"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:HeadObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::kickin-media-photo-dev/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.processing_queue["dev"].aws_lambda_function.processing_lambda will be updated in-place
  ~ resource "aws_lambda_function" "processing_lambda" {
        id                             = "photo-processing-lambda-dev"
      ~ last_modified                  = "2025-07-20T16:15:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "eKLZ9bkYdy5cQgmd3KGLNVcVZE8H5Xs3ugusWx0xqoU=" -> "/I6Im8ENto9SV611KMcHDaM+RjH+uG07bKnR1sXJjo4="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.processing_queue["dev"].aws_sqs_queue.photo-processing-queue will be updated in-place
  ~ resource "aws_sqs_queue" "photo-processing-queue" {
        id                                = "https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-dev"
      ~ max_message_size                  = 1048576 -> 262144
        name                              = "media-photo-processing-dev"
        tags                              = {}
        # (19 unchanged attributes hidden)
    }

  # module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-role-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:ChangeMessageVisibility",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:eu-west-1:990658861879:media-photo-processing-prod",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:HeadObject",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::kickin-media-photo-prod/*",
            ]
        }
    }

  # module.processing_queue["prod"].aws_iam_policy.lambda-role-policy will be updated in-place
  ~ resource "aws_iam_policy" "lambda-role-policy" {
        id               = "arn:aws:iam::990658861879:policy/media-photo-processing-prod-processing-policy"
        name             = "media-photo-processing-prod-processing-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueUrl",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:eu-west-1:990658861879:media-photo-processing-prod"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:HeadObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::kickin-media-photo-prod/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.processing_queue["prod"].aws_lambda_function.processing_lambda will be updated in-place
  ~ resource "aws_lambda_function" "processing_lambda" {
        id                             = "photo-processing-lambda-prod"
      ~ last_modified                  = "2025-07-20T16:15:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "eKLZ9bkYdy5cQgmd3KGLNVcVZE8H5Xs3ugusWx0xqoU=" -> "/I6Im8ENto9SV611KMcHDaM+RjH+uG07bKnR1sXJjo4="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue will be updated in-place
  ~ resource "aws_sqs_queue" "photo-processing-queue" {
        id                                = "https://sqs.eu-west-1.amazonaws.com/990658861879/media-photo-processing-prod"
      ~ max_message_size                  = 1048576 -> 262144
        name                              = "media-photo-processing-prod"
        tags                              = {}
        # (19 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle,
  on mysql-backup.tf line 17, in resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle":
  17: resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @dependabot[bot]*